In [1]:
import os
import pandas as pd
os.chdir('py-master\py-master\pandas\9_merge')
#os.chdir('8_concat')

In [5]:
df1 = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando', 'baltimore'],
    'temperature': [21, 14, 35, 32]
})

df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [7]:
df2 = pd.DataFrame({
    'city': ['chicago', 'new york', 'orlando', 'san francisco'],
    'humidity' : [65, 68, 75, 71]
})

df2

            city  humidity
0        chicago        65
1       new york        68
2        orlando        75
3  san francisco        71

In [11]:
#how is default to 'inner'
df3 = pd.merge(df1, df2, on='city', how='outer', indicator=True)
df3

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0      75.0        both
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

In [13]:
df3._merge

0          both
1          both
2          both
3     left_only
4    right_only
Name: _merge, dtype: category
Categories (3, object): [left_only, right_only, both]